---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc
source: html/aa16343f-5fba-750d-192d-68cb8377237b.htm
---
# RebarShapeDefinitionByArc Members

Create a non-spiral shape definition.